---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCRange Constructor
IFCRange Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IFCRange()()()() | Instantiates a default IFCRange object. |
|  | IFCRange(IFCRange) | Instantiates an IFCRange object by copy. |
|  | IFCRange(Double, Double) | Instantiates an IFCRange object. |

# See Also

IFCRange Class

IFCRange Members

Autodesk.Revit.DB.IFC Namespace